## Plan for tf_roles
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.terragrunt will be destroyed
  - resource "aws_iam_policy" "terragrunt" {
      - arn       = "arn:aws:iam::507252742351:policy/Terragrunt" -> null
      - id        = "arn:aws:iam::507252742351:policy/Terragrunt" -> null
      - name      = "Terragrunt" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "dynamodb:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ca-central-1:507252742351:table/terraform-state-lock-dynamo"
                      - Sid      = "AllowAllDynamoDBActionsOnAllTerragruntTables"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::scan-websites-production-tf/*",
                          - "arn:aws:s3:::scan-websites-production-tf",
                        ]
                      - Sid      = "AllowAllS3ActionsOnTerragruntBuckets"
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:ListSecretVersionIds",
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:ca-central-1:507252742351:secret:*"
                      - Sid      = "AllowReadingSecrets"
                    },
                  - {
                      - Action   = "secretsmanager:ListSecrets"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ListSecrets"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAXMGU6TDHVBCNTJ54V" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # aws_iam_role_policy_attachment.terragrunt will be destroyed
  - resource "aws_iam_role_policy_attachment" "terragrunt" {
      - id         = "gh_plan_role-20220112152659630500000001" -> null
      - policy_arn = "arn:aws:iam::507252742351:policy/Terragrunt" -> null
      - role       = "gh_plan_role" -> null
    }

  # module.attach_tf_plan_policy.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "TFPlan"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "dynamodb:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ca-central-1:507252742351:table/"
                      + Sid      = "AllowAllDynamoDBActionsOnAllTerragruntTables"
                    },
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::scan-websites-production-tf/*",
                          + "arn:aws:s3:::scan-websites-production-tf",
                        ]
                      + Sid      = "AllowAllS3ActionsOnTerragruntBuckets"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:ca-central-1:507252742351:secret:*"
                      + Sid      = "AllowReadingSecrets"
                    },
                  + {
                      + Action   = "secretsmanager:ListSecrets"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ListSecrets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.attach_tf_plan_policy.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "gh_plan_role"
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]

9 tests, 8 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
